data/Parm_PH_29/alpha_10/alpha_10_9000_4048/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
15600
(
0.0400330677499857
0.120088910350581
0.199841057814651
0.27807520774011
0.352737713971927
0.422713421969036
0.488708739938703
0.551975946147586
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
0.0400380308287192
0.120091432314613
0.199802785076396
0.27797179055355
0.352561181409551
0.422485814336024
0.488447664364186
0.551690440051809
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
120
(
0.0375
0.1125
0.1875
0.2625
0.3375
0.4125
0.4875
0.5625
...
)
;
    }
    inlet_half0
    {
        type            cyclic;
    }
    inlet_half1
    {
        type            cyclic;
    }
    outlet_half0
    {
        type            cyclic;
    }
    outlet_half1
    {
        type            cyclic;
    }
    sideRight_half0
    {
        type            empty;
    }
    sideRight_half1
    {
        type            empty;
    }
    sideLeft_half0
    {
        type            empty;
    }
    sideLeft_half1
    {
        type            empty;
    }
}


// ************************************************************************* //
