data/Parm_PH_29/alpha_10/alpha_10_9000_4048/0/tauij_LES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      tauij_LES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor>
15600
(
(0.00636864 -0.00010769 0.00000000 0.00005317 0.00000000 0.00391820)
(0.00713819 -0.00010800 0.00000000 0.00005661 0.00000000 0.00392138)
(0.00142263 0.00006187 0.00000000 -0.00002455 0.00000000 0.00070507)
(0.00064269 0.00001800 0.00000000 -0.00005522 0.00000000 0.00079842)
(0.00060078 -0.00026655 0.00000000 0.00014230 0.00000000 0.00149794)
(0.00033555 -0.00016281 0.00000000 0.00009138 0.00000000 0.00026145)
(0.00085725 -0.00068227 0.00000000 0.00054985 0.00000000 0.00180281)
(0.00031050 -0.00023855 0.00000000 0.00018435 0.00000000 0.00100734)
...
)
;

boundaryField
{
    bottomWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    topWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    inlet_half0
    {
        type        cyclic;
    }
    inlet_half1
    {
        type        cyclic;
    }
    outlet_half0
    {
        type        cyclic;
    }
    outlet_half1
    {
        type        cyclic;
    }
    sideRight_half0
    {
        type        empty;
    }
    sideRight_half1
    {
        type        empty;
    }
    sideLeft_half0
    {
        type        empty;
    }
    sideLeft_half1
    {
        type        empty;
    }
}

// ************************************************************************* //
